In [1]:
import pandas as pdimport numpy as np
import seaborn as sns

In [20]:
ramka1 = pd.DataFrame({"A": np.round(np.random.uniform(0,1,5), 2),
                      "B": ["k",None,"k","m","k"],
                       "C":[False,False,False,True, True]
})
ramka1

      A     B      C
0  0.72     k  False
1  0.46  None  False
2  0.09     k  False
3  0.39     m   True
4  0.30     k   True

In [3]:
len(ramka1)

5

In [4]:
flights = sns.load_dataset("flights")

In [5]:
tips = sns.load_dataset("tips")

In [6]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [7]:
flights.tail()

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [8]:
flights.dtypes

year             int64
month         category
passengers       int64
dtype: object

In [9]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
year          144 non-null int64
month         144 non-null category
passengers    144 non-null int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [10]:
ramka1["A"]

0    0.61
1    0.23
2    0.93
3    0.08
4    0.25
Name: A, dtype: float64

In [11]:
ramka1.A

0    0.61
1    0.23
2    0.93
3    0.08
4    0.25
Name: A, dtype: float64

In [12]:
ramka1.dtypes

A    float64
B     object
C       bool
dtype: object

In [21]:
ramka1.B = ramka1.B.astype("category")

In [22]:
ramka1.dtypes

A     float64
B    category
C        bool
dtype: object

In [33]:
inna_kategoryczna = pd.Series(pd.Categorical(("a","b","c","a"), ordered=True))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a < b < c]

In [34]:
inna_kategoryczna.cat.add_categories("e")

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [a < b < c < e]

In [36]:
inna_kategoryczna.sort_values()

0    a
3    a
1    b
2    c
dtype: category
Categories (3, object): [a < b < c]

In [37]:
ramka1.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
ramka1.columns

Index(['A', 'B', 'C'], dtype='object')

In [39]:
ramka2 = ramka1.copy()

In [43]:
ramka2.index = ['a','c','s','w','a']

In [44]:
ramka2

      A    B      C
a  0.72    k  False
c  0.46  NaN  False
s  0.09    k  False
w  0.39    m   True
a  0.30    k   True

In [46]:
ramka2.reset_index()

  index     A    B      C
0     a  0.72    k  False
1     c  0.46  NaN  False
2     s  0.09    k  False
3     w  0.39    m   True
4     a  0.30    k   True

In [47]:
b = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

2    0.16
1    0.90
5    0.24
3    0.20
0    0.13
9    0.51
7    0.35
8    0.64
4    0.97
6    0.76
dtype: float64

In [48]:
b[0:2]

2    0.16
1    0.90
dtype: float64

In [49]:
b[b>0.5]

1    0.90
9    0.51
8    0.64
4    0.97
6    0.76
dtype: float64

In [50]:
b[0]

0.13

In [52]:
b.iloc[0]

0.16

In [53]:
b.loc[0]

0.13

In [54]:
b.loc[5:7]

5    0.24
3    0.20
0    0.13
9    0.51
7    0.35
dtype: float64

In [55]:
ramka1["D"] = np.exp(ramka1.A)+1000
ramka1

      A    B      C            D
0  0.72    k  False  1002.054433
1  0.46  NaN  False  1001.584074
2  0.09    k  False  1001.094174
3  0.39    m   True  1001.476981
4  0.30    k   True  1001.349859

In [56]:
ramka1.loc[5] = [0,'m',False,1000]
ramka1

      A    B      C            D
0  0.72    k  False  1002.054433
1  0.46  NaN  False  1001.584074
2  0.09    k  False  1001.094174
3  0.39    m   True  1001.476981
4  0.30    k   True  1001.349859
5  0.00    m  False  1000.000000